Accuracy: 0.984469212497716
F1: 0.9115421073301064

Model: "model_12"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_13 (InputLayer)        (None, 187, 1)            0         
_________________________________________________________________
conv1d_45 (Conv1D)           (None, 185, 16)           64        
_________________________________________________________________
conv1d_46 (Conv1D)           (None, 183, 16)           784       
_________________________________________________________________
max_pooling1d_23 (MaxPooling (None, 91, 16)            0         
_________________________________________________________________
dropout_23 (Dropout)         (None, 91, 16)            0         
_________________________________________________________________
conv1d_47 (Conv1D)           (None, 89, 32)            1568      
_________________________________________________________________
conv1d_48 (Conv1D)           (None, 87, 32)            3104      
_________________________________________________________________
max_pooling1d_24 (MaxPooling (None, 43, 32)            0         
_________________________________________________________________
dropout_24 (Dropout)         (None, 43, 32)            0         
_________________________________________________________________
batch_normalization_1 (Batch (None, 43, 32)            128       
_________________________________________________________________
rnn (CuDNNGRU)               (None, 100)               40200     
_________________________________________________________________
dense (Dense)                (None, 200)               20200     
_________________________________________________________________
out_layer (Dense)            (None, 5)                 1005      
=================================================================
Total params: 67,053
Trainable params: 66,989
Non-trainable params: 64
_________________________________________________________________
